In [53]:
import pandas as pd
df = pd.read_csv("california_housing_train.csv")

In [54]:
df.shape

(17000, 9)

In [55]:
df.dtypes

longitude             float64
latitude              float64
housing_median_age    float64
total_rooms           float64
total_bedrooms        float64
population            float64
households            float64
median_income         float64
median_house_value    float64
dtype: object

In [56]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 17000 entries, 0 to 16999
Data columns (total 9 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   longitude           17000 non-null  float64
 1   latitude            17000 non-null  float64
 2   housing_median_age  17000 non-null  float64
 3   total_rooms         17000 non-null  float64
 4   total_bedrooms      17000 non-null  float64
 5   population          17000 non-null  float64
 6   households          17000 non-null  float64
 7   median_income       17000 non-null  float64
 8   median_house_value  17000 non-null  float64
dtypes: float64(9)
memory usage: 1.2 MB

In [57]:
df.isna().sum()

longitude             0
latitude              0
housing_median_age    0
total_rooms           0
total_bedrooms        0
population            0
households            0
median_income         0
median_house_value    0
dtype: int64

In [58]:
df[df["median_income"] < 2][["median_house_value", "median_income"]]

       median_house_value  median_income
0                 66900.0         1.4936
1                 80100.0         1.8200
2                 85700.0         1.6509
4                 65500.0         1.9250
7                 48500.0         1.7083
...                   ...            ...
16984             70000.0         1.8242
16989             58100.0         1.6528
16990             78300.0         1.7038
16994             76100.0         1.9417
16998             85800.0         1.9797

[2005 rows x 2 columns]

Вывод двух столбцов

In [59]:
df.iloc[:,0:1]

       longitude
0        -114.31
1        -114.47
2        -114.56
3        -114.57
4        -114.57
...          ...
16995    -124.26
16996    -124.27
16997    -124.30
16998    -124.30
16999    -124.35

[17000 rows x 1 columns]

In [60]:
df[(df["housing_median_age"]<20) & (df["median_house_value"] > 70000)]

,longitude,latitude,housing_median_age,total_rooms,total_bedrooms,population,households,median_income,median_house_value
1,-114.47,34.40,19.0,7650.0,1901.0,1129.0,463.0,1.8200,80100.0
2,-114.56,33.69,17.0,720.0,174.0,333.0,117.0,1.6509,85700.0
3,-114.57,33.64,14.0,1501.0,337.0,515.0,226.0,3.1917,73400.0
10,-114.60,33.62,16.0,3741.0,801.0,2434.0,824.0,2.6797,86500.0
23,-114.98,33.82,15.0,644.0,129.0,137.0,52.0,3.2097,71300.0
...,...,...,...,...,...,...,...,...,...
16976,-124.17,40.75,13.0,2171.0,339.0,951.0,353.0,4.8516,116100.0
16983,-124.19,41.78,15.0,3140.0,714.0,1645.0,640.0,1.6654,74600.0
16991,-124.23,41.75,11.0,3159.0,616.0,1343.0,479.0,2.4805,73200.0
16997,-124.30,41.84,17.0,2677.0,531.0,1244.0,456.0,3.0313,103600.0
16998,-124.30,41.80,19.0,2672.0,552.0,1298.0,478.0,1.9797,85800.0

1. Определить какое максимальное и минимальное
значение median_house_value
2. Показать максимальное median_house_value, где
median_income = 3.1250
3. Узнать какая максимальная population в зоне
минимального значения median_house_value

In [61]:
df["median_house_value"].min(), df["median_house_value"].max()

(14999.0, 500001.0)

In [62]:
df[df["median_income"] == 3.1250][["median_house_value"]].max()

median_house_value    380400.0
dtype: float64

In [74]:
# Узнать какая максимальная population в зоне минимального значения median_house_value
# df[df["median_house_value"] == df["median_house_value"].min()]["population"].max()
df[df["median_house_value"] == df["median_house_value"].min()][["median_house_value","population"]].sort_values("population").tail(1)

      median_house_value  population
3226             14999.0       628.0